scenarios = [
    {
        "title": "[튜토리얼] 바다거북스프",
        "scenario": "한 남자가, 어느 바닷가 레스토랑에서 바다거북 수프를 주문했고 바다거북 수프를 한 수저 먹고는 주방장을 불렀다.\n\n남자 : 죄송합니다. 이거 정말로 바다거북 수프인가요? \n\n주방장 : 네, 틀림없는 바다거북 수프 맞습니다.\n\n남자는 계산을 마친 뒤 집에 돌아가서 자살했다.\n왜 그랬을까?\n\n",
        "truth": "남자는 배를 타고 있었는데 남자가 탄 배가 조난되었다. 몇 명의 다른 사람들과 함께 구명보트를 타서 죽음은 면했지만, 작은 섬에 표류하는 처지가 되었다. 식재가 떨어진 일행은 체력이 떨어지는 사람부터 죽어가기 시작했다. 결국, 살아남은 사람들은 살기 위하여 시체의 살을 먹기 시작했지만, 단 한 사람은 이 행위를 강력하게 거부했다. 당연히 그 남자는 서서히 죽어가게 되었다. 이 꼴을 가만히 둘 수 없었던 다른 사람 중 하나가 “이건 바다거북 수프야”라고 거짓말을 한 다음 남자에게 수프를 먹여서, 구조될 때까지 살아남을 수 있었다. 그 뒤 레스토랑에서 명백하게 맛이 전혀 다른 이 진짜 바다거북 수프를 직면하게 된 남자는 진실을 알게 된 뒤 목숨을 끊었다."
    },
    {
        "title": "바텐더와 총",
        "scenario": "한 남자가 바에 들어와서 물 한 잔 청했다.\n그러자 바텐더가 총을 꺼내더니 그를 향해 겨누었다.\n남자는 바텐더에게 \"고맙소\"하고는, 바를 떠났다.\n남자가 왜 그랬을까?",
        "truth": "이 사람은 딸꾹질을 하고 있어서 멈추려고 물 한 잔 달라고 하였고, 바텐더는 놀래켜서 멈추려고 총을 꺼냈다. 그리고 놀라서 딸꾹질이 멈추자 고맙다고 한 후 나간 것이다."
    },
    {
        "title": "식재료",
        "scenario": "A는 아이와 숨바꼭질을 하다가\n식탁에 올라온 식재료들을 보고 새파랗게 질렸다.\n왜그랬을까?",
        "truth": "A는 집에서 아이와 숨바꼭질을 하고 있었고 A는 술래역할이었다.\n한참동안 아이를 찾아도 아이를 발견할 수 없었지만 냉장고에 있어야 할 식재료가 식탁에 꺼내져 있는 걸 보고 자신의 아이가 냉장고에 숨어있었다는 걸 깨달으며 새파랗게 질린 것이다."
    },
    {
        "title": "스킨스쿠버",
        "scenario": "어떤 남자가 스킨스쿠버 복장을 완벽하게 갖춘 채\n새까맣게 타버린 나무에 매달려 죽어 있었다.\n이 남자가 이렇게 죽게 된 이유는?",
        "truth": "남자가 스킨스쿠버를 하고 있던 중, 근처에서 산불이 발생하였다. 화재 진압을 위해 헬리콥터가 남자가 스쿠버다이빙을 하던 곳의 물을 퍼올렸고, 그 과정에서 남자가 같이 떠올라갔다. 결국 화재 현장에 물과 함께 추락한 남성은 나무에 걸려 매달려 죽고 말았다."
    },
    {
        "title": "사막의 성냥개비",
        "scenario": "사막 한복판에 알몸의 남성이 부러진 성냥 하나를 들고 죽어있다.\n이 남성에게 무슨 일이 있었을까?",
        "truth": "열기구를 타고 여행하던 4명의 여행객은 하늘에서 길을 잃고 사막 위를 떠다니다 연료가 떨어지자 무게를 줄이기 위해 짐을 밖으로 던졌다. 하지만 열기구는 계속 추락했고 결국 모두가 죽기보다 한 사람의 희생을 선택했다. 이들은 제비뽑기로 희생자를 결정했고 4개의 성냥개비 중 꺾인 성냥개비를 뽑은 사람이 희생자가 되었다. 꺾인 성냥개비를 뽑은 남자는 다른 이들을 위해 열기구 밖으로 뛰어내렸다."
    },
    {
        "title": "생일 그날",
        "scenario": "A, B, C는 오랜 친구 사이이다.\nA의 생일 날, A는 B와 C를 집에 초대했다.\nA의 집에 도착한 B와 C는 생일축하 노래를 부르고\n박수를 치며 진심으로 A의 생일을 축하해 줬다.\n하지만 생일파티가 끝난 이후 A는 B와 C를 살해했다.\n이유가 무엇일까?",
        "truth": "A는 앞이 보이지 않는 시각 장애인이다. A, B, C는 함께 여행을 갔다가 조난을 당한 적이 있다. 먹을 것이 없어 굶어 죽을 지경이 되었던 셋은 각자 팔을 한 쪽씩 잘라 먹기로 했다. 하지만 B와 C는 A가 시각장애인이라는 것을 이용해 모두 각자의 팔을 잘랐다고 거짓말하며, 사실은 A의 팔만 잘라서 구조될 때까지 그것을 먹고 버텼다. B와 C의 팔은 자르지 않았던 것이다. A의 생일을 축하하며 B와 C가 박수를 쳤고, A는 B와 C의 팔이 멀쩡하다는 것을 알게 되었다. 자신을 속였다는 사실을 알고 분노한 A는 B와 C를 살해했다."
    },
    {
        "title": "엘리베이터의 비밀",
        "scenario": "한 아이는 건물의 10층에 거주하고 있다.\n걷기 싫어하는 아이는 매일 1층으로 내려갈 때\n엘리베이터를 이용한다.\n\n그렇지만 그는 맑은 날씨에 외출을 한 후\n집에 돌아올 때는 7층을 누르고\n나머지 층수는 걸어서 10층에 도달한다.\n왜 그럴까?",
        "truth": "이 아이는 키가 작아서 10층 버튼을 손으로는 누를 수 없다. 비 오는 날엔 우산을 가지고 있어서 우산으로 10층 버튼을 누를 수 있다. 하지만 맑은 날엔 우산을 들고 다니지 않기 때문에 손으로 누를 수 있는 가장 높은 7층까지만 누르고 걸어 올라간다."
    },
    {
        "title": "개미",
        "scenario": "나는 개미를 죽였을 뿐인데\n내 옆의 남자가 죽었다.\n왜일까?",
        "truth": "나와 남자는 횡단보도 앞에 서 있었다. 내 발 바로 앞에 지나가는 개미가 보였고, 나는 발을 뻗어 개미를 밟아 죽였다. 옆에서 폰을 하고 있던 남자는 내 움직임으로 인해 신호등이 초록색으로 바뀐 줄 알았던 것이다. 그렇게 남자는 신호등이 빨간불일 때 횡단보도를 건너다 그만 차에 치이고 말았다."
    },
    {
        "title": "바닷가에서 일어난 비극",
        "scenario": "A가 바다를 가리키고 있다.\nB는 그쪽을 바라보고 절망했다.\n왜 그랬을까?",
        "truth": "A는 살해당한 피해자이며, B는 형사였다. A는 죽기 직전 바닷가 모래 위에 검지로 다잉 메시지를 남겼다. 하지만 형사가 현장에 도착했을 땐 밀물이 다녀간 후였고, 메시지는 파도에 쓸려 지워진 상태였다."
    }
]

MAX_QUESTIONS = 20
MAX_HINTS = 3

tutorial_questions = [
    "그는 조난당한 적이 있나요?",
    "사람들은 생존을 위해 시체를 먹었나요?",
    "그는 시체를 먹는것을 거부했나요?",
    "사람들이 그에게 시체로 끓인 것을 바다거북스프라고 속였나요?",
]
